Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/credited_social_insurance_contributions.html.txt.tmx
Source language: en
Languages: ga

source: Credited social insurance contributions
ga: Ranníocaíochtaí creidiúnaithe árachais shóisialaigh

source: If you are an employee, your employer makes Pay Related Social Insurance (PRSI) deductions from your earnings each week
ga: Más fostaí thú, baintear Árachas Sóisialta Pá-Choibhneasa (ÁSPC) as do thuarastal gach seachtain

source: These PRSI contributions to the Social Insurance Fund can help you to qualify for social insurance payments, such as Jobseeker's Benefit and State Pension (Contributory)
ga: Is féidir le do ranníocaíochtaí ÁSPC don Chiste Árachais Shóisialaigh cuidiú leat cailiú d’íocaíochtaí árachais shóisialaigh, mar Sochar Cuardaitheora Poist agus Pinsean Stáit (Ranníocaíoch)

source: If you are out of work you may qualify for a credited contribution
ga: Má tá tú as obair b’fhéidir nach mbeadh ranníocaíocht ÁSPC agat ach b’fhéidir go mbeifeá cáilithe le haghaidh ranníocaíocht chreidiúnaithe

source: A credited social insurance contribution is a contribution given to you and recorded on your social insurance record
ga: Is é atá i gceist le ranníocaíocht chreidiúnaithe árachais shóisialaigh ná ranníocaíocht a thugtar duit agus atá taifeadta ar do thaifead Árachais Shóisialaigh

source: In some cases you can combine your paid and credited contributions to help you qualify for a social insurance payment
ga: Ligeann cuid de na ranníocaíochtaí leasa shóisialaigh duit do ranníocaíochtaí íoctha agus creidiúnaithe a thabhairt le chéile chun cuidiú leat cáiliú le haghaidh íocaíocht árachais shóisialaigh

source: To qualify for a credit you must have worked and paid at least one PRSI contribution at PRSI Class A, B, C, D, E, or H and have paid or credited contributions in either of the last two completed tax years
ga: Le bheith cáilithe le haghaidh creidmheasanna caithfidh go raibh tú ag obair agus gur íoc tú ar a laghad aon ranníocaíocht ÁSPC ag aicme ÁSPC A, B, C, D, E, nó H agus caithfidh gur íoc tú ranníocaíochtaí íoctha nó creidiúnaithe i gceann amháin de cheachtar den dá bhliain chríochnaithe chánach

source: For example, if you are applying for credits in 2017 you must have paid or credited contributions in either 2016 or 2015
ga: Mar shampla, má tá tú ag cur isteach ar ‘chreidmheasanna’ i 2017 caithfidh gur íoc tú ranníocaíochtaí íoctha nó creidiúnaithe i 2016 nó i 2015

source: If there is a gap of more than two completed tax years you must work and pay contributions for a further 26 weeks before you qualify for credited contributions
ga: Má tá bearna ann de níos mó ná dhá bhliain chánach críochnaithe beidh ort bheith ag obair agus rannaíocaíochtaí a íoc go ceann 26 seachtaine eile sula mbeidh tú cáilithe le haghaidh ranníocaíochtaí creidiúnaithe

source: Your credit will only help you to qualify for the social insurance payments appropriate to your PRSI class
ga: Is iondúil go dtugtar creidmheasanna ag an ráta céanna leis an ranníocaíocht ÁSPC a íocadh go deireanach

source: For example, if your last paid PRSI contribution was Class A your credits will be for Class A
ga: Ní chuideoidh do chreidmheas leat ach cáiliú le haghaidh na híocaíochtaí árachais shóisialaigh atá oiriúnach do do ghrád ÁSPC

source: If however, your last PRSI contribution was at Class B your credits will be for Class B
ga: Mar shampla, má bhí do ranníocaíocht dheireanach ÁSPC ag aicme A, beidh do chuid ‘creidmheasanna’ ag aicme A ach má bhí do ranníocaíocht dheireanach ÁSPC ag aicme B beidh do creidmheasanna le haghaidh aicme B

source: More information is available about social insurance classes and the social welfare payments for each class
ga: Léigh anseo le níos mó faisnéise a fháil faoi aicmí árachais shóisialaigh agus na híocaíochtaí atá ar fáil i ngach aicme

source: Pre-entry credits when you start work
ga: Creidmheasanna réamhiontrála nuair a thosaíonn tú ag obair

source: When you start work you are automatically given pre-entry credits
ga: Nuair a thosóidh tú ag obair tabharfar creidmheasanna réamhiontrála duit go huathoibríoch

source: These credits are normally given once and cover you from the beginning of the tax year in which you start work, up to the actual date you start work
ga: Is gnách go dtugtar na creidmheasanna seo uair amháin agus clúdaíonn siad thú ó thús na bliana cánach ina dtosaíonn tú ag obair, suas leis an bhfíordháta ar a dtosaíonn tú ag obair

source: The credits also cover you for the two previous income tax years
ga: Clúdaíonn na creidmheasanna tú don dá bhliain chánach ioncaim roimhe sin

source: Your pre-entry credits can help you to qualify for the following social insurance payments:
ga: A luaithe agus a bheidh tú ag obair do ‘creidmheasanna réamhiontrála’ cuidiú leat cáiliú le haghaidh na n-íocaíochtaí árachais shóisialaigh seo a leanas:

source: • Health and Safety Benefit
ga: • Sochar Sláinte agus Sábháilteachta

source: You get credits automatically if you are fully unemployed and getting Jobseeker's Benefit
ga: Faigheann tú creidmheasanna go huathoibríoch má bhíonn tú lán-dífhostaithe agus ag fáil Sochar Cuardaitheora Poist

source: You can continue to get credits if you have used up your entitlement to Jobseeker's Benefit and qualify for Jobseeker's Allowance
ga: Is féidir leat leanúint de bheith ag fáil creidmheasanna má tá do theidlíocht ar Shochar Cuardaitheora Poist ídithe agat agus tú cáilithe do Liúntas Cuardaitheora Poist

source: You do not automatically get credits if you are getting Jobseeker's Allowance
ga: Caithfidh go bhfuil ranníocaíochtaí ÁSPC íoctha nó curtha chun sochair agat i gceachtar den dá bhliain chánach dheireanacha le ‘creidmheasanna’ a fháil le Liúntas Cuardaitheora Poist

source: You must have paid or credited PRSI contributions in either of the last two tax years to get credits with Jobseeker's Allowance
ga: Má tá tú dífhostaithe ach mura bhfuil tu i dteideal íocaíocht leasa shóisialaigh a bheith agat is féidir leat síniú le haghaidh creidmheasanna má tá tú ar fáil agus in ann obair a dhéanamh

source: You can sign on for credits, if you are not entitled to a social welfare payment or you are a qualified adult on your spouse's, civil partner's or cohabitant's social welfare payment as long as you:
ga: Is féidir leat síniú i gcomhair creidmheasanna, mura bhfuil tú i dteideal íocaíochta leasa shóisialaigh nó más duine fásta cáilithe tú ar íocaíocht leasa shóisialaigh do chéile/páirtnéir sibhialta/comhchónaitheoirchomh fada agus go bhfuil tú:

source: • Available and capable of work
ga: • Ar fáil agus ábalta dul ag obair

source: • Have paid or credited PRSI contributions in either of the last two tax years
ga: • Tar éis ranníocaíochtaí ÁSPC a bheith íoctha nó creidiúnaithe agat sa dá bhliain cánach is déanaí

source: You can also sign on for credits if you are on strike from work
ga: Is féidir leat síniú le haghaidh creidmheasanna chomh maith má bhíonn tú ar stailc ón obair

source: You must sign on for credits in your Intreo centre or social welfare local office - see 'Where to apply' below
ga: Caithfidh tú síniú le haghaidh creidmheasanna i d’oifig leasa shóisialaigh áitiúil - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are unemployed and getting credits you can continue to get credits if you take part in one of the following:
ga: Má tá tú dífhostaithe agus ag fáil creidmheasanna is féidir leat leanúint de bheith ag fáil creidmheasanna má bhíonn tú páirteach i gceann de na cúrsaí seo a leanas:

source: • Back to Education Allowance Scheme (BTEA)
ga: • Liúntas chun Filleadh ar an Oideachais (Dara agus Tríú Leibhéal)

source: • Vocational Training Opportunities Scheme (VTOS)
ga: • Scéim Deiseanna Oiliúna Gairmoideachais (VTOS)

source: If you qualify for the BTEA Scheme after signing on for credits you take part on a non-payment basis
ga: Má cháilíonn tú le haghaidh Scéim Liúntais um Fhilleadh ar Oideachas i ndiaidh síniú i gcomhair creidmheasanna, glacann tú páirt ar bhonn neamhíocaíochta

source: This means that you do not get a weekly Back to Education Allowance
ga: Ciallaíonn sé nach bhfaighidh tú Liúntais um Fhilleadh ar Oideachas seachtainiúil

source: Credits are awarded if you are getting Illness Benefit, Injury Benefit and Invalidity Pension
ga: Damhtar creidmheasanna má bhíonn tú ag fáil Sochar Breoiteachta agus Sochar Easláinte

source: If you use up your entitlement to Illness Benefit or Injury Benefit and you qualify for Disablement Benefit you should continue to submit medical certificates to ensure that you continue to get credits
ga: Má ídíonn tú do theidlíocht ar Shochar Breoiteachta (SB) nó Sochar Díobhála Ceirde (SDC) agus má tá tú cáilithe ar Fhorlíonadh Éagumais ba cheart duit leanúint ar aghaidh le teastais mhíochaine a chur isteach lena chinntiú go leanfaidh tú de bheith ag fáil creidmheasanna

source: If you have applied for Illness Benefit or Injury Benefit and don't qualify, you may still be entitled to credits if you have paid or credited contributions in the last two tax years
ga: Má chuir tú iarratas isteach ar Shochar Breoiteachta nó ar Shochar Díobhála Ceirde agus níl tú cáilithe, b’fhéidir go mbeifeá i dteideal fós creidmheas a fháil más amhlaidh go bhfuil ranníocaíochtaí íoctha nó creidiúnaithe agat sa dá bhliain chánach dheireanacha

source: If you are getting Disability Allowance because you have used up your entitlement to Illness Benefit you will get credits
ga: Má bhíonn tú ag fáil Liúntas Míchumais cionn is go bhfuil do theidlíocht ar Shochar Breoiteachta ídithe agat, gheobhaidh tú ‘creidmheasanna’

source: To get credits while on Disability Allowance you must have paid or credited contributions in the last two years
ga: Le ‘creidmheasanna’ a fháil le linn duit a bheith ar Liúntas Míchumais caithfidh go bhfuil ranníocaíochtaí íoctha nó curtha chun sochair agat sa dá bhliain roimhe sin

source: Public servants who give up work because of ill health can protect their entitlement to certain payments by sending in medical certificates once a year
ga: Is féidir le seirbhísigh phoiblí a éiríonn as obair mar gheall ar dhrochshláinte a dteidlíocht ar íocaíochtaí áirithe a chosaint trí theastais mhíochaine a sheoladh isteach uair amháin sa bhliain

source: You can continue to get credits during illness, if you take part in the Back to Education Allowance Scheme
ga: Is féidir leat leanúint ag fáil creidmheasanna le linn tinnis, má ghlacann tú páirt sa Scéim Liúntas um Fhilleadh ar an Oideachas

source: If you give up work to care for someone and get Carer's Allowance or Carer's Benefit you will be awarded credits
ga: Má éiríonn tú as obair le cúram a thabhairt do dhuine éigin agus má fhaigheann tú Liúntas Cúramóra nó Sochar Cúramóra tabharfar creidmheasanna duit

source: You will also get credits if you do not get one of these payment but are on Carer's Leave from work
ga: Gheobhaidh tú creidmheasanna chomh maith mura bhfaigheann tú ceann de na híocaíochtaí seo ach tá tú ar saoire chúramóra ón obair

source: If however, you avail of unpaid statutory Carer's Leave you must get your employer to complete an application for carer's leave 'credits' (pdf) when you return to work
ga: Má bhaineann tú úsáid as saoire chúramóra reachtach neamhíoctha, áfach, caithfidh tú iarraidh ar d’fhostaitheoir iarratas ar chreidmheasanna saoire cúramóra atá le fáil i mileog faisnéise SW49 de chuid na Roinne Coimirce Sóisialaí (pdf) a líonadh, i ndiaidh duit filleadh ar obair

source: The Homemaker's Scheme can make it easier for homemakers to qualify for a State Pension (Contributory)
ga: Is féidir le Scéim na nDéantóirí Baile é a dhéanamh níos fusa do dhéantóirí baile cáiliú do Phinsean Stáit (Ranníocaíoch)

source: If you give up work to look after a child under 12 years of age, or a disabled child, or adult, you can get credits from the date you give up work to the end of that contribution year
ga: Má éiríonn tú as obair le haire a thabhairt do leanbh faoi bhun 12 bliana d’aois, nó leanbh míchumasaithe, nó duine fásta, is féidir leat creidmheasanna a fháil ón dáta a n-éiríonn tú as obair chuig deireadh na bliana ranníocaíochta seo

source: If you are out of the workforce for the complete contribution year the complete year is disregarded when you are assessed for a State Pension (Contributory)
ga: Má tá tú lasmuigh den saol oibre ar feadh na bliana iomláine rannaíocaíochta déantar neamhaird ar an mbliain iomlán maidir le measúnú don Phinsean Stáit (Ranníocaíoch)

source: In some cases people who are jobsharing may be eligible for homemakers credits if they are job-sharing to look after a child under 12 or a disabled child or adult
ga: I gcásanna áirithe is féidir daoine a bheith i dteideal creidmheasanna déantóirí baile má bhíonn siad ag comhroinnt oibre chun aire a thabhairt do leanbh faoi bhun 12 bliana d’aois, nó do leanbh nó duine fásta míchumasaithe

source: Student credits are only given once, and can cover periods in full-time education
ga: Ní thugtar creidmheasanna mac léinn ach aon uair amháin agus is féidir leo tréimhsí san oideachas lánaimseartha a chlúdach

source: To qualify you must have worked and paid PRSI Class A before starting your course
ga: Le bheith cáilithe caithfidh sé go raibh tú ag obair agus go raibh ÁSPC grád A íoctha agat sular thosaigh tú ar an gcúrsa duit

source: You must have started your course before you reached 23 years of age and before you have taken up full-time insurable employment
ga: Caithfidh gur thosaigh tú do chúrsa sular shroich tú 23 bliana d’aois amach agus sula ndeachaigh tú isteach i bhfostaíocht inárachais lánaimseartha

source: You apply for student credits when you are applying for a social insurance payment
ga: Cuireann tú iarratas isteach ar ‘chreidmheasanna’ mac léinn ag am céanna agus atá tú ag cur iarratais isteach ar íocaíocht árachais shóisialaigh

source: You must supply written confirmation from the school or college stating that you were a student there, and the dates you attended
ga: Caithfidh tú dearbhú scríofa a chur ar fáil ón scoil nó ón gcoláiste ag rá go raibh tú i do mhac léinn ansin agus na dátaí a raibh tú ag freastal ann

source: You may also have to show that you have started full-time employment
ga: B’fhéidir go mbeadh ort a thaispeáint go bhfuil fostaíocht lánaimseartha tosaithe agat chomh maith

source: This can mean submitting your P60 or a letter from your employer
ga: B’fhéidir go mbeadh ort do P60 nó litir ó d’fhostaitheoir a chur faoi bhráid

source: Credits for maternity leave, adoptive leave, parental leave, Health and Safety Benefit
ga: Creidmheasanna do shaoire mháithreachais, shaoire uchtála, shaoire thuismitheoireachta, Shochair Sláinte agus Sábháilteachta

source: You will automatically be awarded credits while you are getting Maternity Benefit, Adoptive Benefit or Health and Safety Benefit
ga: Tabharfar creidmheasanna duit go huathoibríoch agus tú ag fáil Sochar Máithreachais, Sochar Uchtála, nó Sochar Sláinte agus Sábháilteachta

source: If however you avail of unpaid statutory maternity leave you must get your employer to complete an application for maternity leave credits (pdf) when you return to work
ga: Má bhaineann tú úsáid as saoire máithreachais neamhíoctha reachtúil caithfidh tú a iarraidh ar d’fhostaitheoir iarratas ar chreidmheasanna saoire máithreachais atá le fáil i leabhrán faisnéise na Roinne Coimirce Sóisialaí SW 11 (pdf) a líonadh i ndiaidh duit filleadh ar obair

source: Similarly, if you avail of unpaid statutory adoptive leave you must get your employer to complete an application for adoptive leave credits (pdf) when you return to work
ga: Ar an dóigh chéanna, má bhaineann tú úsáid as saoire uchtála neamhíoctha reachtúil caithfidh tú a iarraidh ar d’fhostaitheoir iarratas ar chreidmheasanna saoire uchtála atá le fáil i leabhrán faisnéise na Roinne Coimirce Sóisialaí SW 37 (pdf) a líonadh i ndiaidh duit filleadh ar obair

source: If you take parental leave, your employer must contact the Records Section of Department of Social Protection, detailing the weeks you have not worked, so that you can get credits for this time - see 'Where to apply' below
ga: Má ghlacann tú saoire tuismitheora, caithfidh d’fhostaitheoir teagmháil a dhéanamh le Rannóg na dTaifead den Roinn Coimirce Sóisialaí, ag sonrú na seachtainí nach raibh tú ag obair, ionas gur féidir leat ‘creidmheasanna’ a fháil don am seo - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: Volunteer development worker's credits
ga: Creidmheasanna d’oibrí deonach forbartha

source: If you spend time as a volunteer development worker abroad, you may be entitled to credits for the time you spend as a volunteer development worker abroad up to a maximum of five years
ga: Má chaitheann tú am mar oibrí deonach forbartha thar lear, b’fhéidir go mbeifeá i dteideal ‘creidmheasanna’ a bheith agat as an am a chaitheann tú mar oibrí deonach forbartha thar lear suas le huasmhéid de chúig bliana

source: Volunteer development worker's credits can help you to maintain your social insurance record
ga: Léigh anseo le níos mó faisnéise a fháil faoi 'chreidmheasanna' d’oibrithe deonacha forbartha

source: You may qualify for change of status credits if you are insurably employed at PRSI Class A and your last paid PRSI contribution was at Class B, C or D
ga: D'fhéadfá a bheith cáilithe le haghaidh creidmheasanna athraithe stádais má tá tú ag gabháil d'fhostaíocht inárachais faoi ÁSPC Aicme A agus má bhí do ranníocaíocht íoctha dheireanach ÁSPC déanta in Aicme B, C nó D

source: These change of status credits are only taken into account for the State Pension (Contributory)
ga: Ní chuirtear na creidmheasanna athraithe stádais seo san áireamh ach amháin le haghaidh Pinsean Stáit (Ranníocach)

source: You can get change of status credits back to the beginning of the tax year in which you start making PRSI contributions at the Class A rate and for the previous tax year
ga: Is féidir leat creidmheasanna athraithe stádais a fháil siar go dtí tús na bliana cánach inar thosaigh tú ag déanamh ranníocaíochtaí ÁSPC ar ráta Aicme A agus le haghaidh na bliana cánach roimhe sin

source: A mixture of PRSI contributions at Class A and PRSI contributions at Class B, C or D may help you to qualify for a mixed insurance pro-rata State Pension (Contributory)
ga: D'fhéadfadh comhcheangal de ranníocaíochtaí ÁSPC in Aicme A agus ranníocaíochtaí ÁSPC in Aicmí B, C nó D cabhrú leat cáiliú le haghaidh Pinsean Stáit (Ranníocach) pro-rata d'árachas measctha amach anseo

source: Credits are automatically awarded if you are getting any of the following payments:
ga: Tugtar creidmheasanna go huathoibríoch má bhíonn tú ag fáil aon chinn de na híocaíochtaí seo a leanas:

source: If unemployed or on strike you should sign-on for credits at your Intreo centre or social welfare local office
ga: Má bhíonn tú dífhostaithe nó ar stailc ba cheart duit síniú le haghaidh creidmheasanna ag do oifig áitiúil leasa shóisialaigh
